# General
cask "1password"
cask "arc"
# web: boosteroid
cask "mullvadvpn"
cask "obsidian"
cask "signal"
cask "slack"
cask "spotify"
# web: todoist

# Development
brew "doctl"
brew "git"
brew "pyenv"

# cask "db-browser-for-sqlite"
cask "docker"
cask "dotnet-sdk"
cask "github"
cask "iterm2"
cask "parallels"
cask "postman"
cask "raspberry-pi-imager"
cask "sublime-text"
cask "vagrant-vmware-utility"
cask "vagrant"
cask "visual-studio-code"
cask "vmware-fusion"
cask "vnc-viewer"

mas "Xcode", id: 497799835

# Utilities
brew "htop"
brew "mas"
brew "stow"
brew "tmux"
brew "tree"
brew "zbar"

cask "aldente"
cask "appcleaner"
cask "hiddenbar"
cask "monitorcontrol"
cask "obs"
cask "openinterminal"
cask "scroll-reverser"
cask "synology-drive"
# web: tinkertool
cask "vlc"

mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466

# Creative
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "updf"

mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Safari Extensions
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "SponsorBlock for YouTube", id: 1573461917
mas "Speed Player for Safari", id: 1521133201
